zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/pio/pic32cm5112sg00064.h
#define PIN_PB00B_AC_AIN2                          _UINT32_(32)
#define MUX_PB00B_AC_AIN2                          _UINT32_(1) 
#define PINMUX_PB00B_AC_AIN2                       ((PIN_PB00B_AC_AIN2 << 16) | MUX_PB00B_AC_AIN2)
#define PORT_PB00B_AC_AIN2                         (_UINT32_(1) << 0)

#define PIN_PB03B_AC_AIN3                          _UINT32_(35)
#define MUX_PB03B_AC_AIN3                          _UINT32_(1) 
#define PINMUX_PB03B_AC_AIN3                       ((PIN_PB03B_AC_AIN3 << 16) | MUX_PB03B_AC_AIN3)
#define PORT_PB03B_AC_AIN3                         (_UINT32_(1) << 3)

#define PIN_PA01B_AC_CMP0                          _UINT32_(1) 
#define MUX_PA01B_AC_CMP0                          _UINT32_(1) 
#define PINMUX_PA01B_AC_CMP0                       ((PIN_PA01B_AC_CMP0 << 16) | MUX_PA01B_AC_CMP0)
#define PORT_PA01B_AC_CMP0                         (_UINT32_(1) << 1)

#define PIN_PA13B_AC_CMP0                          _UINT32_(13)
#define MUX_PA13B_AC_CMP0                          _UINT32_(1) 
#define PINMUX_PA13B_AC_CMP0                       ((PIN_PA13B_AC_CMP0 << 16) | MUX_PA13B_AC_CMP0)
#define PORT_PA13B_AC_CMP0                         (_UINT32_(1) << 13)

#define PIN_PA02B_AC_CMP1                          _UINT32_(2) 
#define MUX_PA02B_AC_CMP1                          _UINT32_(1) 
#define PINMUX_PA02B_AC_CMP1                       ((PIN_PA02B_AC_CMP1 << 16) | MUX_PA02B_AC_CMP1)
#define PORT_PA02B_AC_CMP1                         (_UINT32_(1) << 2)

#define PIN_PB07B_AC_CMP1                          _UINT32_(39)
#define MUX_PB07B_AC_CMP1                          _UINT32_(1) 
#define PINMUX_PB07B_AC_CMP1                       ((PIN_PB07B_AC_CMP1 << 16) | MUX_PB07B_AC_CMP1)
#define PORT_PB07B_AC_CMP1                         (_UINT32_(1) << 7)

/* =================== PORT definition for ADC peripheral =================== */
#define PIN_PA03B_ADC_ADC0_AIN0                    _UINT32_(3) 
#define MUX_PA03B_ADC_ADC0_AIN0                    _UINT32_(1) 
#define PINMUX_PA03B_ADC_ADC0_AIN0                 ((PIN_PA03B_ADC_ADC0_AIN0 << 16) | MUX_PA03B_ADC_ADC0_AIN0)
#define PORT_PA03B_ADC_ADC0_AIN0                   (_UINT32_(1) << 3)

#define PIN_PA04B_ADC_ADC0_AIN1                    _UINT32_(4) 
#define MUX_PA04B_ADC_ADC0_AIN1                    _UINT32_(1) 
#define PINMUX_PA04B_ADC_ADC0_AIN1                 ((PIN_PA04B_ADC_ADC0_AIN1 << 16) | MUX_PA04B_ADC_ADC0_AIN1)
#define PORT_PA04B_ADC_ADC0_AIN1                   (_UINT32_(1) << 4)

#define PIN_PA05B_ADC_ADC0_AIN2                    _UINT32_(5) 
#define MUX_PA05B_ADC_ADC0_AIN2                    _UINT32_(1) 
#define PINMUX_PA05B_ADC_ADC0_AIN2                 ((PIN_PA05B_ADC_ADC0_AIN2 << 16) | MUX_PA05B_ADC_ADC0_AIN2)
#define PORT_PA05B_ADC_ADC0_AIN2                   (_UINT32_(1) << 5)

#define PIN_PA06B_ADC_ADC0_AIN3                    _UINT32_(6) 
#define MUX_PA06B_ADC_ADC0_AIN3                    _UINT32_(1) 
#define PINMUX_PA06B_ADC_ADC0_AIN3                 ((PIN_PA06B_ADC_ADC0_AIN3 << 16) | MUX_PA06B_ADC_ADC0_AIN3)
#define PORT_PA06B_ADC_ADC0_AIN3                   (_UINT32_(1) << 6)

#define PIN_PA07B_ADC_ADC0_AIN4                    _UINT32_(7) 
#define MUX_PA07B_ADC_ADC0_AIN4                    _UINT32_(1) 
#define PINMUX_PA07B_ADC_ADC0_AIN4                 ((PIN_PA07B_ADC_ADC0_AIN4 << 16) | MUX_PA07B_ADC_ADC0_AIN4)
#define PORT_PA07B_ADC_ADC0_AIN4                   (_UINT32_(1) << 7)

#define PIN_PA08B_ADC_ADC0_AIN5                    _UINT32_(8) 
#define MUX_PA08B_ADC_ADC0_AIN5                    _UINT32_(1) 
#define PINMUX_PA08B_ADC_ADC0_AIN5                 ((PIN_PA08B_ADC_ADC0_AIN5 << 16) | MUX_PA08B_ADC_ADC0_AIN5)
#define PORT_PA08B_ADC_ADC0_AIN5                   (_UINT32_(1) << 8)

#define PIN_PA09B_ADC_ADC0_AIN6                    _UINT32_(9) 
#define MUX_PA09B_ADC_ADC0_AIN6                    _UINT32_(1) 
#define PINMUX_PA09B_ADC_ADC0_AIN6                 ((PIN_PA09B_ADC_ADC0_AIN6 << 16) | MUX_PA09B_ADC_ADC0_AIN6)
#define PORT_PA09B_ADC_ADC0_AIN6                   (_UINT32_(1) << 9)

#define PIN_PB00B_ADC_ADC0_AIN7                    _UINT32_(32)
#define MUX_PB00B_ADC_ADC0_AIN7                    _UINT32_(1) 
#define PINMUX_PB00B_ADC_ADC0_AIN7                 ((PIN_PB00B_ADC_ADC0_AIN7 << 16) | MUX_PB00B_ADC_ADC0_AIN7)
#define PORT_PB00B_ADC_ADC0_AIN7                   (_UINT32_(1) << 0)

#define PIN_PB03B_ADC_ADC0_AIN8                    _UINT32_(35)
#define MUX_PB03B_ADC_ADC0_AIN8                    _UINT32_(1) 
#define PINMUX_PB03B_ADC_ADC0_AIN8                 ((PIN_PB03B_ADC_ADC0_AIN8 << 16) | MUX_PB03B_ADC_ADC0_AIN8)
#define PORT_PB03B_ADC_ADC0_AIN8                   (_UINT32_(1) << 3)

#define PIN_PB04B_ADC_ADC0_AIN9                    _UINT32_(36)
#define MUX_PB04B_ADC_ADC0_AIN9                    _UINT32_(1) 
#define PINMUX_PB04B_ADC_ADC0_AIN9                 ((PIN_PB04B_ADC_ADC0_AIN9 << 16) | MUX_PB04B_ADC_ADC0_AIN9)
#define PORT_PB04B_ADC_ADC0_AIN9                   (_UINT32_(1) << 4)

#define PIN_PB05B_ADC_ADC0_AIN10                   _UINT32_(37)
#define MUX_PB05B_ADC_ADC0_AIN10                   _UINT32_(1) 
#define PINMUX_PB05B_ADC_ADC0_AIN10                ((PIN_PB05B_ADC_ADC0_AIN10 << 16) | MUX_PB05B_ADC_ADC0_AIN10)
#define PORT_PB05B_ADC_ADC0_AIN10                  (_UINT32_(1) << 5)

#define PIN_PB06B_ADC_ADC0_AIN11                   _UINT32_(38)
#define MUX_PB06B_ADC_ADC0_AIN11                   _UINT32_(1) 
#define PINMUX_PB06B_ADC_ADC0_AIN11                ((PIN_PB06B_ADC_ADC0_AIN11 << 16) | MUX_PB06B_ADC_ADC0_AIN11)
#define PORT_PB06B_ADC_ADC0_AIN11                  (_UINT32_(1) << 6)

#define PIN_PA04B_ADC_ADC0_ANN0                    _UINT32_(4) 
#define MUX_PA04B_ADC_ADC0_ANN0                    _UINT32_(1) 
#define PINMUX_PA04B_ADC_ADC0_ANN0                 ((PIN_PA04B_ADC_ADC0_ANN0 << 16) | MUX_PA04B_ADC_ADC0_ANN0)
#define PORT_PA04B_ADC_ADC0_ANN0                   (_UINT32_(1) << 4)

#define PIN_PA06B_ADC_ADC0_ANN2                    _UINT32_(6) 
#define MUX_PA06B_ADC_ADC0_ANN2                    _UINT32_(1) 
#define PINMUX_PA06B_ADC_ADC0_ANN2                 ((PIN_PA06B_ADC_ADC0_ANN2 << 16) | MUX_PA06B_ADC_ADC0_ANN2)
#define PORT_PA06B_ADC_ADC0_ANN2                   (_UINT32_(1) << 6)

