zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/pio/pic32cm5112sg00064.h
#define PIN_PC00I_CCL0_OUT3                        _UINT32_(64)
#define MUX_PC00I_CCL0_OUT3                        _UINT32_(8) 
#define PINMUX_PC00I_CCL0_OUT3                     ((PIN_PC00I_CCL0_OUT3 << 16) | MUX_PC00I_CCL0_OUT3)
#define PORT_PC00I_CCL0_OUT3                       (_UINT32_(1) << 0)

/* ================== PORT definition for CCL1 peripheral =================== */
#define PIN_PC04I_CCL1_IN0                         _UINT32_(68)
#define MUX_PC04I_CCL1_IN0                         _UINT32_(8) 
#define PINMUX_PC04I_CCL1_IN0                      ((PIN_PC04I_CCL1_IN0 << 16) | MUX_PC04I_CCL1_IN0)
#define PORT_PC04I_CCL1_IN0                        (_UINT32_(1) << 4)

#define PIN_PC05I_CCL1_IN1                         _UINT32_(69)
#define MUX_PC05I_CCL1_IN1                         _UINT32_(8) 
#define PINMUX_PC05I_CCL1_IN1                      ((PIN_PC05I_CCL1_IN1 << 16) | MUX_PC05I_CCL1_IN1)
#define PORT_PC05I_CCL1_IN1                        (_UINT32_(1) << 5)

#define PIN_PC10I_CCL1_IN2                         _UINT32_(74)
#define MUX_PC10I_CCL1_IN2                         _UINT32_(8) 
#define PINMUX_PC10I_CCL1_IN2                      ((PIN_PC10I_CCL1_IN2 << 16) | MUX_PC10I_CCL1_IN2)
#define PORT_PC10I_CCL1_IN2                        (_UINT32_(1) << 10)

#define PIN_PD06I_CCL1_IN3                         _UINT32_(102)
#define MUX_PD06I_CCL1_IN3                         _UINT32_(8) 
#define PINMUX_PD06I_CCL1_IN3                      ((PIN_PD06I_CCL1_IN3 << 16) | MUX_PD06I_CCL1_IN3)
#define PORT_PD06I_CCL1_IN3                        (_UINT32_(1) << 6)

#define PIN_PD07I_CCL1_IN4                         _UINT32_(103)
#define MUX_PD07I_CCL1_IN4                         _UINT32_(8) 
#define PINMUX_PD07I_CCL1_IN4                      ((PIN_PD07I_CCL1_IN4 << 16) | MUX_PD07I_CCL1_IN4)
#define PORT_PD07I_CCL1_IN4                        (_UINT32_(1) << 7)

#define PIN_PD11I_CCL1_IN5                         _UINT32_(107)
#define MUX_PD11I_CCL1_IN5                         _UINT32_(8) 
#define PINMUX_PD11I_CCL1_IN5                      ((PIN_PD11I_CCL1_IN5 << 16) | MUX_PD11I_CCL1_IN5)
#define PORT_PD11I_CCL1_IN5                        (_UINT32_(1) << 11)

#define PIN_PD12I_CCL1_IN5                         _UINT32_(108)
#define MUX_PD12I_CCL1_IN5                         _UINT32_(8) 
#define PINMUX_PD12I_CCL1_IN5                      ((PIN_PD12I_CCL1_IN5 << 16) | MUX_PD12I_CCL1_IN5)
#define PORT_PD12I_CCL1_IN5                        (_UINT32_(1) << 12)

#define PIN_PA09I_CCL1_IN6                         _UINT32_(9) 
#define MUX_PA09I_CCL1_IN6                         _UINT32_(8) 
#define PINMUX_PA09I_CCL1_IN6                      ((PIN_PA09I_CCL1_IN6 << 16) | MUX_PA09I_CCL1_IN6)
#define PORT_PA09I_CCL1_IN6                        (_UINT32_(1) << 9)

#define PIN_PA06I_CCL1_IN7                         _UINT32_(6) 
#define MUX_PA06I_CCL1_IN7                         _UINT32_(8) 
#define PINMUX_PA06I_CCL1_IN7                      ((PIN_PA06I_CCL1_IN7 << 16) | MUX_PA06I_CCL1_IN7)
#define PORT_PA06I_CCL1_IN7                        (_UINT32_(1) << 6)

#define PIN_PA11I_CCL1_IN8                         _UINT32_(11)
#define MUX_PA11I_CCL1_IN8                         _UINT32_(8) 
#define PINMUX_PA11I_CCL1_IN8                      ((PIN_PA11I_CCL1_IN8 << 16) | MUX_PA11I_CCL1_IN8)
#define PORT_PA11I_CCL1_IN8                        (_UINT32_(1) << 11)

#define PIN_PA12I_CCL1_IN8                         _UINT32_(12)
#define MUX_PA12I_CCL1_IN8                         _UINT32_(8) 
#define PINMUX_PA12I_CCL1_IN8                      ((PIN_PA12I_CCL1_IN8 << 16) | MUX_PA12I_CCL1_IN8)
#define PORT_PA12I_CCL1_IN8                        (_UINT32_(1) << 12)

#define PIN_PB04I_CCL1_IN9                         _UINT32_(36)
#define MUX_PB04I_CCL1_IN9                         _UINT32_(8) 
#define PINMUX_PB04I_CCL1_IN9                      ((PIN_PB04I_CCL1_IN9 << 16) | MUX_PB04I_CCL1_IN9)
#define PORT_PB04I_CCL1_IN9                        (_UINT32_(1) << 4)

#define PIN_PB03I_CCL1_IN10                        _UINT32_(35)
#define MUX_PB03I_CCL1_IN10                        _UINT32_(8) 
#define PINMUX_PB03I_CCL1_IN10                     ((PIN_PB03I_CCL1_IN10 << 16) | MUX_PB03I_CCL1_IN10)
#define PORT_PB03I_CCL1_IN10                       (_UINT32_(1) << 3)

#define PIN_PB07I_CCL1_IN11                        _UINT32_(39)
#define MUX_PB07I_CCL1_IN11                        _UINT32_(8) 
#define PINMUX_PB07I_CCL1_IN11                     ((PIN_PB07I_CCL1_IN11 << 16) | MUX_PB07I_CCL1_IN11)
#define PORT_PB07I_CCL1_IN11                       (_UINT32_(1) << 7)

#define PIN_PB08I_CCL1_IN11                        _UINT32_(40)
#define MUX_PB08I_CCL1_IN11                        _UINT32_(8) 
#define PINMUX_PB08I_CCL1_IN11                     ((PIN_PB08I_CCL1_IN11 << 16) | MUX_PB08I_CCL1_IN11)
#define PORT_PB08I_CCL1_IN11                       (_UINT32_(1) << 8)

#define PIN_PC06I_CCL1_OUT0                        _UINT32_(70)
#define MUX_PC06I_CCL1_OUT0                        _UINT32_(8) 
#define PINMUX_PC06I_CCL1_OUT0                     ((PIN_PC06I_CCL1_OUT0 << 16) | MUX_PC06I_CCL1_OUT0)
#define PORT_PC06I_CCL1_OUT0                       (_UINT32_(1) << 6)

#define PIN_PD09I_CCL1_OUT1                        _UINT32_(105)
#define MUX_PD09I_CCL1_OUT1                        _UINT32_(8) 
#define PINMUX_PD09I_CCL1_OUT1                     ((PIN_PD09I_CCL1_OUT1 << 16) | MUX_PD09I_CCL1_OUT1)
#define PORT_PD09I_CCL1_OUT1                       (_UINT32_(1) << 9)

#define PIN_PA05I_CCL1_OUT2                        _UINT32_(5) 
#define MUX_PA05I_CCL1_OUT2                        _UINT32_(8) 
#define PINMUX_PA05I_CCL1_OUT2                     ((PIN_PA05I_CCL1_OUT2 << 16) | MUX_PA05I_CCL1_OUT2)
#define PORT_PA05I_CCL1_OUT2                       (_UINT32_(1) << 5)

#define PIN_PB00I_CCL1_OUT3                        _UINT32_(32)
#define MUX_PB00I_CCL1_OUT3                        _UINT32_(8) 
#define PINMUX_PB00I_CCL1_OUT3                     ((PIN_PB00I_CCL1_OUT3 << 16) | MUX_PB00I_CCL1_OUT3)
#define PORT_PB00I_CCL1_OUT3                       (_UINT32_(1) << 0)

/* =================== PORT definition for EIC peripheral =================== */
#define PIN_PA00A_EIC_EXTINT0                      _UINT32_(0) 
#define MUX_PA00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PA00A_EIC_EXTINT0                   ((PIN_PA00A_EIC_EXTINT0 << 16) | MUX_PA00A_EIC_EXTINT0)
#define PORT_PA00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PA00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PA00 External Interrupt Line */

#define PIN_PB00A_EIC_EXTINT0                      _UINT32_(32)
#define MUX_PB00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PB00A_EIC_EXTINT0                   ((PIN_PB00A_EIC_EXTINT0 << 16) | MUX_PB00A_EIC_EXTINT0)
#define PORT_PB00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PB00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PB00 External Interrupt Line */

#define PIN_PC00A_EIC_EXTINT0                      _UINT32_(64)
#define MUX_PC00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PC00A_EIC_EXTINT0                   ((PIN_PC00A_EIC_EXTINT0 << 16) | MUX_PC00A_EIC_EXTINT0)
#define PORT_PC00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PC00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PC00 External Interrupt Line */

#define PIN_PA01A_EIC_EXTINT1                      _UINT32_(1) 
#define MUX_PA01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PA01A_EIC_EXTINT1                   ((PIN_PA01A_EIC_EXTINT1 << 16) | MUX_PA01A_EIC_EXTINT1)
#define PORT_PA01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PA01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PA01 External Interrupt Line */

#define PIN_PB01A_EIC_EXTINT1                      _UINT32_(33)
#define MUX_PB01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PB01A_EIC_EXTINT1                   ((PIN_PB01A_EIC_EXTINT1 << 16) | MUX_PB01A_EIC_EXTINT1)
#define PORT_PB01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PB01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PB01 External Interrupt Line */

#define PIN_PC01A_EIC_EXTINT1                      _UINT32_(65)
#define MUX_PC01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PC01A_EIC_EXTINT1                   ((PIN_PC01A_EIC_EXTINT1 << 16) | MUX_PC01A_EIC_EXTINT1)
#define PORT_PC01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PC01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PC01 External Interrupt Line */

