zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/pio/pic32cm5112sg00064.h
#define PIN_PC05A_EIC_EXTINT5                      _UINT32_(69)
#define MUX_PC05A_EIC_EXTINT5                      _UINT32_(0) 
#define PINMUX_PC05A_EIC_EXTINT5                   ((PIN_PC05A_EIC_EXTINT5 << 16) | MUX_PC05A_EIC_EXTINT5)
#define PORT_PC05A_EIC_EXTINT5                     (_UINT32_(1) << 5)
#define PIN_PC05A_EIC_EXTINT_NUM                   _UINT32_(5)  /* EIC signal: PIN_PC05 External Interrupt Line */

#define PIN_PD08A_EIC_EXTINT5                      _UINT32_(104)
#define MUX_PD08A_EIC_EXTINT5                      _UINT32_(0) 
#define PINMUX_PD08A_EIC_EXTINT5                   ((PIN_PD08A_EIC_EXTINT5 << 16) | MUX_PD08A_EIC_EXTINT5)
#define PORT_PD08A_EIC_EXTINT5                     (_UINT32_(1) << 8)
#define PIN_PD08A_EIC_EXTINT_NUM                   _UINT32_(5)  /* EIC signal: PIN_PD08 External Interrupt Line */

#define PIN_PA06A_EIC_EXTINT6                      _UINT32_(6) 
#define MUX_PA06A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PA06A_EIC_EXTINT6                   ((PIN_PA06A_EIC_EXTINT6 << 16) | MUX_PA06A_EIC_EXTINT6)
#define PORT_PA06A_EIC_EXTINT6                     (_UINT32_(1) << 6)
#define PIN_PA06A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PA06 External Interrupt Line */

#define PIN_PB06A_EIC_EXTINT6                      _UINT32_(38)
#define MUX_PB06A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PB06A_EIC_EXTINT6                   ((PIN_PB06A_EIC_EXTINT6 << 16) | MUX_PB06A_EIC_EXTINT6)
#define PORT_PB06A_EIC_EXTINT6                     (_UINT32_(1) << 6)
#define PIN_PB06A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PB06 External Interrupt Line */

#define PIN_PC06A_EIC_EXTINT6                      _UINT32_(70)
#define MUX_PC06A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PC06A_EIC_EXTINT6                   ((PIN_PC06A_EIC_EXTINT6 << 16) | MUX_PC06A_EIC_EXTINT6)
#define PORT_PC06A_EIC_EXTINT6                     (_UINT32_(1) << 6)
#define PIN_PC06A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PC06 External Interrupt Line */

#define PIN_PD09A_EIC_EXTINT6                      _UINT32_(105)
#define MUX_PD09A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PD09A_EIC_EXTINT6                   ((PIN_PD09A_EIC_EXTINT6 << 16) | MUX_PD09A_EIC_EXTINT6)
#define PORT_PD09A_EIC_EXTINT6                     (_UINT32_(1) << 9)
#define PIN_PD09A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PD09 External Interrupt Line */

#define PIN_PA07A_EIC_EXTINT7                      _UINT32_(7) 
#define MUX_PA07A_EIC_EXTINT7                      _UINT32_(0) 
#define PINMUX_PA07A_EIC_EXTINT7                   ((PIN_PA07A_EIC_EXTINT7 << 16) | MUX_PA07A_EIC_EXTINT7)
#define PORT_PA07A_EIC_EXTINT7                     (_UINT32_(1) << 7)
#define PIN_PA07A_EIC_EXTINT_NUM                   _UINT32_(7)  /* EIC signal: PIN_PA07 External Interrupt Line */

#define PIN_PA08A_EIC_EXTINT8                      _UINT32_(8) 
#define MUX_PA08A_EIC_EXTINT8                      _UINT32_(0) 
#define PINMUX_PA08A_EIC_EXTINT8                   ((PIN_PA08A_EIC_EXTINT8 << 16) | MUX_PA08A_EIC_EXTINT8)
#define PORT_PA08A_EIC_EXTINT8                     (_UINT32_(1) << 8)
#define PIN_PA08A_EIC_EXTINT_NUM                   _UINT32_(8)  /* EIC signal: PIN_PA08 External Interrupt Line */

#define PIN_PB07A_EIC_EXTINT8                      _UINT32_(39)
#define MUX_PB07A_EIC_EXTINT8                      _UINT32_(0) 
#define PINMUX_PB07A_EIC_EXTINT8                   ((PIN_PB07A_EIC_EXTINT8 << 16) | MUX_PB07A_EIC_EXTINT8)
#define PORT_PB07A_EIC_EXTINT8                     (_UINT32_(1) << 7)
#define PIN_PB07A_EIC_EXTINT_NUM                   _UINT32_(8)  /* EIC signal: PIN_PB07 External Interrupt Line */

#define PIN_PD10A_EIC_EXTINT8                      _UINT32_(106)
#define MUX_PD10A_EIC_EXTINT8                      _UINT32_(0) 
#define PINMUX_PD10A_EIC_EXTINT8                   ((PIN_PD10A_EIC_EXTINT8 << 16) | MUX_PD10A_EIC_EXTINT8)
#define PORT_PD10A_EIC_EXTINT8                     (_UINT32_(1) << 10)
#define PIN_PD10A_EIC_EXTINT_NUM                   _UINT32_(8)  /* EIC signal: PIN_PD10 External Interrupt Line */

#define PIN_PA09A_EIC_EXTINT9                      _UINT32_(9) 
#define MUX_PA09A_EIC_EXTINT9                      _UINT32_(0) 
#define PINMUX_PA09A_EIC_EXTINT9                   ((PIN_PA09A_EIC_EXTINT9 << 16) | MUX_PA09A_EIC_EXTINT9)
#define PORT_PA09A_EIC_EXTINT9                     (_UINT32_(1) << 9)
#define PIN_PA09A_EIC_EXTINT_NUM                   _UINT32_(9)  /* EIC signal: PIN_PA09 External Interrupt Line */

#define PIN_PB08A_EIC_EXTINT9                      _UINT32_(40)
#define MUX_PB08A_EIC_EXTINT9                      _UINT32_(0) 
#define PINMUX_PB08A_EIC_EXTINT9                   ((PIN_PB08A_EIC_EXTINT9 << 16) | MUX_PB08A_EIC_EXTINT9)
#define PORT_PB08A_EIC_EXTINT9                     (_UINT32_(1) << 8)
#define PIN_PB08A_EIC_EXTINT_NUM                   _UINT32_(9)  /* EIC signal: PIN_PB08 External Interrupt Line */

#define PIN_PC09A_EIC_EXTINT9                      _UINT32_(73)
#define MUX_PC09A_EIC_EXTINT9                      _UINT32_(0) 
#define PINMUX_PC09A_EIC_EXTINT9                   ((PIN_PC09A_EIC_EXTINT9 << 16) | MUX_PC09A_EIC_EXTINT9)
#define PORT_PC09A_EIC_EXTINT9                     (_UINT32_(1) << 9)
#define PIN_PC09A_EIC_EXTINT_NUM                   _UINT32_(9)  /* EIC signal: PIN_PC09 External Interrupt Line */

#define PIN_PD11A_EIC_EXTINT9                      _UINT32_(107)
#define MUX_PD11A_EIC_EXTINT9                      _UINT32_(0) 
#define PINMUX_PD11A_EIC_EXTINT9                   ((PIN_PD11A_EIC_EXTINT9 << 16) | MUX_PD11A_EIC_EXTINT9)
#define PORT_PD11A_EIC_EXTINT9                     (_UINT32_(1) << 11)
#define PIN_PD11A_EIC_EXTINT_NUM                   _UINT32_(9)  /* EIC signal: PIN_PD11 External Interrupt Line */

#define PIN_PA10A_EIC_EXTINT10                     _UINT32_(10)
#define MUX_PA10A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PA10A_EIC_EXTINT10                  ((PIN_PA10A_EIC_EXTINT10 << 16) | MUX_PA10A_EIC_EXTINT10)
#define PORT_PA10A_EIC_EXTINT10                    (_UINT32_(1) << 10)
#define PIN_PA10A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PA10 External Interrupt Line */

#define PIN_PB09A_EIC_EXTINT10                     _UINT32_(41)
#define MUX_PB09A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PB09A_EIC_EXTINT10                  ((PIN_PB09A_EIC_EXTINT10 << 16) | MUX_PB09A_EIC_EXTINT10)
#define PORT_PB09A_EIC_EXTINT10                    (_UINT32_(1) << 9)
#define PIN_PB09A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PB09 External Interrupt Line */

