zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/pio/pic32cm5112sg00064.h
#define PIN_PC02D_SERCOM0_PAD2                     _UINT32_(66)
#define MUX_PC02D_SERCOM0_PAD2                     _UINT32_(3) 
#define PINMUX_PC02D_SERCOM0_PAD2                  ((PIN_PC02D_SERCOM0_PAD2 << 16) | MUX_PC02D_SERCOM0_PAD2)
#define PORT_PC02D_SERCOM0_PAD2                    (_UINT32_(1) << 2)

#define PIN_PC03D_SERCOM0_PAD3                     _UINT32_(67)
#define MUX_PC03D_SERCOM0_PAD3                     _UINT32_(3) 
#define PINMUX_PC03D_SERCOM0_PAD3                  ((PIN_PC03D_SERCOM0_PAD3 << 16) | MUX_PC03D_SERCOM0_PAD3)
#define PORT_PC03D_SERCOM0_PAD3                    (_UINT32_(1) << 3)

/* ================= PORT definition for SERCOM1 peripheral ================= */
#define PIN_PD01D_SERCOM1_PAD0                     _UINT32_(97)
#define MUX_PD01D_SERCOM1_PAD0                     _UINT32_(3) 
#define PINMUX_PD01D_SERCOM1_PAD0                  ((PIN_PD01D_SERCOM1_PAD0 << 16) | MUX_PD01D_SERCOM1_PAD0)
#define PORT_PD01D_SERCOM1_PAD0                    (_UINT32_(1) << 1)

#define PIN_PD00D_SERCOM1_PAD1                     _UINT32_(96)
#define MUX_PD00D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PD00D_SERCOM1_PAD1                  ((PIN_PD00D_SERCOM1_PAD1 << 16) | MUX_PD00D_SERCOM1_PAD1)
#define PORT_PD00D_SERCOM1_PAD1                    (_UINT32_(1) << 0)

#define PIN_PC06D_SERCOM1_PAD2                     _UINT32_(70)
#define MUX_PC06D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PC06D_SERCOM1_PAD2                  ((PIN_PC06D_SERCOM1_PAD2 << 16) | MUX_PC06D_SERCOM1_PAD2)
#define PORT_PC06D_SERCOM1_PAD2                    (_UINT32_(1) << 6)

#define PIN_PD10D_SERCOM1_PAD2                     _UINT32_(106)
#define MUX_PD10D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PD10D_SERCOM1_PAD2                  ((PIN_PD10D_SERCOM1_PAD2 << 16) | MUX_PD10D_SERCOM1_PAD2)
#define PORT_PD10D_SERCOM1_PAD2                    (_UINT32_(1) << 10)

#define PIN_PC05D_SERCOM1_PAD3                     _UINT32_(69)
#define MUX_PC05D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PC05D_SERCOM1_PAD3                  ((PIN_PC05D_SERCOM1_PAD3 << 16) | MUX_PC05D_SERCOM1_PAD3)
#define PORT_PC05D_SERCOM1_PAD3                    (_UINT32_(1) << 5)

#define PIN_PD11D_SERCOM1_PAD3                     _UINT32_(107)
#define MUX_PD11D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PD11D_SERCOM1_PAD3                  ((PIN_PD11D_SERCOM1_PAD3 << 16) | MUX_PD11D_SERCOM1_PAD3)
#define PORT_PD11D_SERCOM1_PAD3                    (_UINT32_(1) << 11)

/* ================= PORT definition for SERCOM2 peripheral ================= */
#define PIN_PC04D_SERCOM2_PAD0                     _UINT32_(68)
#define MUX_PC04D_SERCOM2_PAD0                     _UINT32_(3) 
#define PINMUX_PC04D_SERCOM2_PAD0                  ((PIN_PC04D_SERCOM2_PAD0 << 16) | MUX_PC04D_SERCOM2_PAD0)
#define PORT_PC04D_SERCOM2_PAD0                    (_UINT32_(1) << 4)

#define PIN_PD06D_SERCOM2_PAD1                     _UINT32_(102)
#define MUX_PD06D_SERCOM2_PAD1                     _UINT32_(3) 
#define PINMUX_PD06D_SERCOM2_PAD1                  ((PIN_PD06D_SERCOM2_PAD1 << 16) | MUX_PD06D_SERCOM2_PAD1)
#define PORT_PD06D_SERCOM2_PAD1                    (_UINT32_(1) << 6)

#define PIN_PD07D_SERCOM2_PAD2                     _UINT32_(103)
#define MUX_PD07D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PD07D_SERCOM2_PAD2                  ((PIN_PD07D_SERCOM2_PAD2 << 16) | MUX_PD07D_SERCOM2_PAD2)
#define PORT_PD07D_SERCOM2_PAD2                    (_UINT32_(1) << 7)

#define PIN_PD08D_SERCOM2_PAD3                     _UINT32_(104)
#define MUX_PD08D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PD08D_SERCOM2_PAD3                  ((PIN_PD08D_SERCOM2_PAD3 << 16) | MUX_PD08D_SERCOM2_PAD3)
#define PORT_PD08D_SERCOM2_PAD3                    (_UINT32_(1) << 8)

/* ================= PORT definition for SERCOM3 peripheral ================= */
#define PIN_PD09D_SERCOM3_PAD0                     _UINT32_(105)
#define MUX_PD09D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PD09D_SERCOM3_PAD0                  ((PIN_PD09D_SERCOM3_PAD0 << 16) | MUX_PD09D_SERCOM3_PAD0)
#define PORT_PD09D_SERCOM3_PAD0                    (_UINT32_(1) << 9)

#define PIN_PA00D_SERCOM3_PAD1                     _UINT32_(0) 
#define MUX_PA00D_SERCOM3_PAD1                     _UINT32_(3) 
#define PINMUX_PA00D_SERCOM3_PAD1                  ((PIN_PA00D_SERCOM3_PAD1 << 16) | MUX_PA00D_SERCOM3_PAD1)
#define PORT_PA00D_SERCOM3_PAD1                    (_UINT32_(1) << 0)

#define PIN_PA01D_SERCOM3_PAD2                     _UINT32_(1) 
#define MUX_PA01D_SERCOM3_PAD2                     _UINT32_(3) 
#define PINMUX_PA01D_SERCOM3_PAD2                  ((PIN_PA01D_SERCOM3_PAD2 << 16) | MUX_PA01D_SERCOM3_PAD2)
#define PORT_PA01D_SERCOM3_PAD2                    (_UINT32_(1) << 1)

#define PIN_PA02D_SERCOM3_PAD3                     _UINT32_(2) 
#define MUX_PA02D_SERCOM3_PAD3                     _UINT32_(3) 
#define PINMUX_PA02D_SERCOM3_PAD3                  ((PIN_PA02D_SERCOM3_PAD3 << 16) | MUX_PA02D_SERCOM3_PAD3)
#define PORT_PA02D_SERCOM3_PAD3                    (_UINT32_(1) << 2)

/* ================= PORT definition for SERCOM4 peripheral ================= */
#define PIN_PA03D_SERCOM4_PAD0                     _UINT32_(3) 
#define MUX_PA03D_SERCOM4_PAD0                     _UINT32_(3) 
#define PINMUX_PA03D_SERCOM4_PAD0                  ((PIN_PA03D_SERCOM4_PAD0 << 16) | MUX_PA03D_SERCOM4_PAD0)
#define PORT_PA03D_SERCOM4_PAD0                    (_UINT32_(1) << 3)

#define PIN_PA04D_SERCOM4_PAD1                     _UINT32_(4) 
#define MUX_PA04D_SERCOM4_PAD1                     _UINT32_(3) 
#define PINMUX_PA04D_SERCOM4_PAD1                  ((PIN_PA04D_SERCOM4_PAD1 << 16) | MUX_PA04D_SERCOM4_PAD1)
#define PORT_PA04D_SERCOM4_PAD1                    (_UINT32_(1) << 4)

#define PIN_PA05D_SERCOM4_PAD2                     _UINT32_(5) 
#define MUX_PA05D_SERCOM4_PAD2                     _UINT32_(3) 
#define PINMUX_PA05D_SERCOM4_PAD2                  ((PIN_PA05D_SERCOM4_PAD2 << 16) | MUX_PA05D_SERCOM4_PAD2)
#define PORT_PA05D_SERCOM4_PAD2                    (_UINT32_(1) << 5)

#define PIN_PA06D_SERCOM4_PAD3                     _UINT32_(6) 
#define MUX_PA06D_SERCOM4_PAD3                     _UINT32_(3) 
#define PINMUX_PA06D_SERCOM4_PAD3                  ((PIN_PA06D_SERCOM4_PAD3 << 16) | MUX_PA06D_SERCOM4_PAD3)
#define PORT_PA06D_SERCOM4_PAD3                    (_UINT32_(1) << 6)

/* ================= PORT definition for SERCOM5 peripheral ================= */
#define PIN_PB03D_SERCOM5_PAD0                     _UINT32_(35)
#define MUX_PB03D_SERCOM5_PAD0                     _UINT32_(3) 
#define PINMUX_PB03D_SERCOM5_PAD0                  ((PIN_PB03D_SERCOM5_PAD0 << 16) | MUX_PB03D_SERCOM5_PAD0)
#define PORT_PB03D_SERCOM5_PAD0                    (_UINT32_(1) << 3)

